#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-uci-sso"] must be replaced
-/+ resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce" # forces replacement
      ~ id                      = "/" -> (known after apply)
      + realm_id                = "moh_applications" # forces replacement
      + role                    = "view-client-uci-sso" # forces replacement
      + service_account_user_id = "9ab20ecc-c39f-45d4-992c-8290579a247d" # forces replacement
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-uci-sso"] must be replaced
-/+ resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "ab6e0d99-9205-4625-8ea4-88835ddd36ae" # forces replacement
      ~ id                      = "/" -> (known after apply)
      + realm_id                = "moh_applications" # forces replacement
      + role                    = "view-client-uci-sso" # forces replacement
      + service_account_user_id = "c7a70148-52e9-4158-8b2f-238eb8269328" # forces replacement
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TAP.module.payara-client.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + base_url                                  = "https://tapt.hlth.gov.bc.ca/tap"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "TAP"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "The Travel Assistance Program Analysis Reports is a report web application that allows authorized persons to see how incidence of use of different modes of transportation by the general public."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "TAP"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:8080/*",
          + "https://localhost:8081/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://tapd.hlth.gov.bc.ca/*",
          + "https://tapt.hlth.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TAP.module.payara-client.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "tap_role"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "TAP"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "TAP Role"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TAP.module.payara-client.keycloak_role.ROLES["TAPUSER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TAPUSER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-tap"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-tap"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-tap"
      + realm_id  = "moh_applications"
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ahoplock, Action: `pull_request`*